{"id":"fda60aa0-3d53-11ec-bc51-254eee314233","updated_at":"2021-11-04T09:45:50.553Z","updated_by":"295916864","created_at":"2021-11-04T09:45:50.553Z","created_by":"295916864","name":"Potentially successful bruteforce","tags":[],"interval":"5m","enabled":true,"description":"Potentially successful bruteforce attack","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1h","kibana_siem_app_url":"https://demo.kb.australiaeast.azure.elastic-cloud.com:9243/app/security"},"author":[],"false_positives":[],"from":"now-3900s","rule_id":"42f53346-e16b-45dd-96d1-fbe83d837235","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["apm-*-transaction*","traces-apm*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","winlogbeat-*"],"query":"    sequence by user.name with maxspan=15s\n      [ authentication where event.dataset == \"auditd.log\" and auditd.log.op == \"login\" and event.outcome == \"failed\"]\n      [ authentication where event.dataset == \"auditd.log\" and auditd.log.op == \"login\" and event.outcome == \"failed\"]\n      [ authentication where event.dataset == \"auditd.log\" and auditd.log.op == \"login\" and event.outcome == \"failed\"]\n      [ authentication where event.dataset == \"auditd.log\" and auditd.log.record_type==\"USER_AUTH\" and event.outcome == \"success\"]","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
