{"id":"46760ab0-3ba0-11ec-bc51-254eee314233","updated_at":"2021-11-02T05:51:17.479Z","updated_by":"295916864","created_at":"2021-11-02T05:46:50.602Z","created_by":"295916864","name":"Potential SSH Brute Force on Linux Detected","tags":["Elastic","Host","Threat Detection","Credential Access"],"interval":"5m","enabled":true,"description":"Identifies a high number (20) of failed SSH login attempts on Linux","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"60m","kibana_siem_app_url":"https://demo.kb.australiaeast.azure.elastic-cloud.com:9243/app/security"},"author":["Elastic"],"false_positives":[],"from":"now-3900s","rule_id":"1f5ecbf4-4bba-4662-9153-bb41a00783bd","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1110/","name":"Brute Force","subtechnique":[],"id":"T1110"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://themittenmac.com/detecting-ssh-activity-via-process-monitoring/"],"version":3,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["logs*"],"query":"event.category:\"authentication\" and event.outcome:\"failure\"","filters":[],"threshold":{"field":["host.name"],"value":20,"cardinality":[{"field":"user.name","value":1}]},"throttle":"no_actions","actions":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
